void setup()//哆啦A梦
{
  size(1000,1000);
 
}
void draw()
{background(255);
  fill(#22A7ED);
ellipse(width/2,height/2,500,500);//蓝脸
fill(255);//脸白
ellipse(502,534,429,454);
fill(255);
ellipse(439,319,100,113);//眼白
ellipse(539,315,100,113);
fill(0);
ellipse(457,320,26,39);//眼黑
ellipse(521,318,26,39);
fill(255);
ellipse(462,318,7,14);//高光
ellipse(517,318,7,14);
fill(#C90A0A);
ellipse(491,365,51,50);//红鼻子
fill(255);
ellipse(498,358,17,17);//高光鼻子
line(491,391,490,546);//鼻子下的线)
line(656,386,540,420);//鼻子下的线)
line(680,434,548,444);//鼻子下的线)
line(688,481,552,465);//鼻子下的线)
line(332,386,442,415);//鼻子下的线)
line(299,422,428,440);//鼻子下的线)
line(298,477,434,467);//鼻子下的线)
fill(#E34242);
arc(503, 506, 368, 368, 0,PI, CHORD);//嘴
fill(#AA1517);
rect(309,705,395,60,247,252,517,225);//项圈
fill(#EA5421);
arc(507, 623, 233, 131, -207,PI/1.5, OPEN);//舌头
fill(#F7C620);
ellipse(503,755,78,76);//铃铛
rect(466,736,75,11,247,252,517,225);
fill(#806924);
ellipse(505,769,15,15);
fill(0);
line(505,776,505,794);
}
